code-review/NRB_3471_3546/База_Стало/BusinessProcesses/ОбработкаWTRCСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<BusinessProcess>
		<Properties>
			<Name>ОбработкаWTRCСообщения</Name>
			<Task>Task.ОбработкаWTRCСообщения</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаКДПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПриемаПоручений1_10</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПриемаПоручений1_5</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПриемаФормыW8</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияРаскрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КД</Name>
					<Comment>(Карточка КД)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КДРеференс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполненаПроверкаОстатков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСхемуУсловногоДлящегосяПоручения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Депоненты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьФормаW8BENE_W8BEN</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УведомлениеW8</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗавершенияБПОбработкаWTRCСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уведомление1_10</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗавершенияБПОбработкаWTRCСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапросНаРаскрытие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗавершенияБПОбработкаWTRCСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерОтправленногоУведомления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьУсловноеДлящеесяПоручение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДепонентыПослеФиксации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьФормаW8BENE_W8BEN</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УведомлениеW8</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗавершенияБПОбработкаWTRCСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уведомление1_10</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗавершенияБПОбработкаWTRCСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапросНаРаскрытие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗавершенияБПОбработкаWTRCСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерОтправленногоУведомления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьУсловноеДлящеесяПоручение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДепонентыПриКонтролеОстатков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьФормаW8BENE_W8BEN</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УведомлениеW8</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗавершенияБПОбработкаWTRCСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уведомление1_10</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗавершенияБПОбработкаWTRCСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапросНаРаскрытие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЗавершенияБПОбработкаWTRCСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерОтправленногоУведомления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьУсловноеДлящеесяПоручение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзменилосьКоличество</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Новый</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ПредоставленныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПредоставленныеДокументы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Comment>Включая</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПредоставления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоставленнаяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыW8</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзменениеТарифногоПлана</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовУдостоверяющихПолномочия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Лицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/СтатусыЗавершенияБПОбработкаWTRCСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗавершенияБПОбработкаWTRCСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Успешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоПовторно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сформировано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/СтатусыДокументаЗапросСубброкеруНаРаскрытие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДокументаЗапросСубброкеруНаРаскрытие</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленПовторно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученОтвет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/BusinessProcesses/ОбработкаWTRCСообщения/Ext/ObjectModule.bsl
Перем мОрганизация;

/////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС
Процедура ЗаполнитьТаблицуДепонентов(ИмяТабЧасти = "Депоненты") Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.ЦБ КАК ЦеннаяБумага,
	|	Остатки.СчетДепо.Владелец КАК Депонент,
	|	Остатки.РазделСчетаДепо КАК РазделСчета,
	|	СУММА(Остатки.КоличествоОстаток) КАК Количество
	|ПОМЕСТИТЬ втОстатки
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБМестоРасчетов.Остатки(
	|			&ДатаОстатков,
	|			ЦБ В (&МассивЦенныхБумаг)
	|				И СчетДепоМХ = &СчетДепоМХ) КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.ЦБ,
	|	Остатки.СчетДепо.Владелец,
	|	Остатки.РазделСчетаДепо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФормаW8.Депонент КАК Депонент,
	|	ИСТИНА КАК ЕстьФормаW8
	|ПОМЕСТИТЬ втФормаW8
	|ИЗ
	|	РегистрСведений.ПредоставленныеДокументы.СрезПоследних(
	|			&ДатаОстатков,
	|			ВидДокумента = &ФормаW8
	|				И (СрокДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ СрокДействия >= НАЧАЛОПЕРИОДА(&ДатаОстатков, ДЕНЬ))) КАК ФормаW8
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УсловноеДлящеесяПоручение.Депонент КАК Депонент,
	|	ИСТИНА КАК ЕстьУДП
	|ПОМЕСТИТЬ втУсловноеДлящеесяПоручение
	|ИЗ
	|	РегистрСведений.ПредоставленныеДокументы.СрезПоследних(
	|			&ДатаОстатков,
	|			ВидДокумента = &УсловноеДлящеесяПоручение
	|				И (СрокДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ СрокДействия >= НАЧАЛОПЕРИОДА(&ДатаОстатков, ДЕНЬ))) КАК УсловноеДлящеесяПоручение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Депонент КАК Депонент,
	|	МАКСИМУМ(Разделы.Ссылка) КАК РазделСчетаПолучатель
	|ПОМЕСТИТЬ втНалоговыеРазделыПолучатели
	|ИЗ
	|	Справочник.РазделыСчетаДепо КАК Разделы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОстатки КАК Остатки
	|		ПО (Остатки.Депонент = Разделы.Владелец.Владелец)
	|ГДЕ
	|	Разделы.ТипРазделаСчетаДЕПО = &Налоговый
	|	И НЕ Разделы.ПометкаУдаления
	|	И НЕ Остатки.Депонент.Субброкер
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Депонент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.РазделСчета.Субклиент,
	|	МАКСИМУМ(Разделы.Ссылка)
	|ИЗ
	|	втОстатки КАК Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК Разделы
	|		ПО Остатки.Депонент = Разделы.Владелец.Владелец
	|			И Остатки.РазделСчета.Субклиент = Разделы.Ссылка.Субклиент
	|ГДЕ
	|	Разделы.ТипРазделаСчетаДЕПО = &Налоговый
	|	И НЕ Разделы.ПометкаУдаления
	|	И Остатки.Депонент.Субброкер
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.РазделСчета.Субклиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Остатки.Депонент КАК Депонент,
	|	Остатки.РазделСчета КАК РазделСчета,
	|	Остатки.Количество КАК Количество,
	|	ЕСТЬNULL(ФормаW8.ЕстьФормаW8, ЛОЖЬ) КАК ЕстьФормаW8BENE_W8BEN,
	|	ЕСТЬNULL(УсловноеДлящеесяПоручение.ЕстьУДП, ЛОЖЬ) КАК ЕстьУсловноеДлящеесяПоручение,
	|	НалоговыеРазделы.РазделСчетаПолучатель КАК РазделСчетаПолучатель,
	|	Остатки.ЦеннаяБумага.Наименование КАК ЦеннаяБумагаНаименование,
	|	Остатки.Депонент.Наименование КАК ДепонентНаименование,
	|	Остатки.РазделСчета.Наименование КАК РазделСчетаНаименование
	|ИЗ
	|	втОстатки КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втФормаW8 КАК ФормаW8
	|		ПО Остатки.Депонент = ФормаW8.Депонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ втУсловноеДлящеесяПоручение КАК УсловноеДлящеесяПоручение
	|		ПО Остатки.Депонент = УсловноеДлящеесяПоручение.Депонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНалоговыеРазделыПолучатели КАК НалоговыеРазделы
	|		ПО Остатки.Депонент = НалоговыеРазделы.Депонент
	|ГДЕ
	|	НЕ Остатки.Депонент.Субброкер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.ЦеннаяБумага,
	|	Остатки.Депонент,
	|	Остатки.РазделСчета,
	|	Остатки.Количество,
	|	ЕСТЬNULL(ФормаW8.ЕстьФормаW8, ЛОЖЬ),
	|	ЕСТЬNULL(УсловноеДлящеесяПоручение.ЕстьУДП, ЛОЖЬ),
	|	НалоговыеРазделы.РазделСчетаПолучатель,
	|	Остатки.ЦеннаяБумага.Наименование,
	|	Остатки.Депонент.Наименование,
	|	Остатки.РазделСчета.Наименование
	|ИЗ
	|	втОстатки КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ втФормаW8 КАК ФормаW8
	|		ПО Остатки.РазделСчета.Субклиент = ФормаW8.Депонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ втУсловноеДлящеесяПоручение КАК УсловноеДлящеесяПоручение
	|		ПО Остатки.РазделСчета.Субклиент = УсловноеДлящеесяПоручение.Депонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ втНалоговыеРазделыПолучатели КАК НалоговыеРазделы
	|		ПО Остатки.РазделСчета.Субклиент = НалоговыеРазделы.Депонент
	|ГДЕ
	|	Остатки.Депонент.Субброкер
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦеннаяБумагаНаименование,
	|	ДепонентНаименование,
	|	РазделСчетаНаименование";
	
	МассивЦенныхБумаг = Новый Массив;
	Если ЗначениеЗаполнено(ЦеннаяБумага1) Тогда
		МассивЦенныхБумаг.Добавить(ЦеннаяБумага1);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЦеннаяБумага2) Тогда
		МассивЦенныхБумаг.Добавить(ЦеннаяБумага2);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаФиксации) Тогда
		ДатаОстатков = КонецДня(ДатаФиксации);
	Иначе
		ДатаОстатков = Дата;
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаОстатков",		ДатаОстатков);
	Запрос.УстановитьПараметр("МассивЦенныхБумаг",	МассивЦенныхБумаг);
	Запрос.УстановитьПараметр("Налоговый",			Перечисления.ТипыРазделовСчетовДЕПО.Налоговый);
	Запрос.УстановитьПараметр("ФормаW8", Справочники.ВидыДокументовУдостоверяющихПолномочия.ФормаW8BENE_W8BEN);
	Запрос.УстановитьПараметр("УсловноеДлящеесяПоручение", Справочники.ВидыДокументовУдостоверяющихПолномочия.УсловноеДлящеесяПоручение);
	Запрос.УстановитьПараметр("СчетДепоМХ",			СчетДепоМХ);	
	
	ЭтотОбъект[ИмяТабЧасти].Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

/////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ЗапроситьФормуW8ПриНеобходимостиОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.ОбработкаWTRCСообщения.ТочкиМаршрута.ЗапроситьФормуW8ПриНеобходимости Тогда
		ИмяТабЧастиИсточника = "Депоненты";
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.ОбработкаWTRCСообщения.ТочкиМаршрута.ДозапроситьФормуW8ПриНеобходимостиПослеФиксации Тогда
		ИмяТабЧастиИсточника = "ДепонентыПослеФиксации";
	КонецЕсли;
	
	Если НЕ РезультатЗапросаФормыW8(ДепонентыБезФормыW8(ИмяТабЧастиИсточника)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"Необходимо исправить ошибки и стартовать бизнес-процесс еще раз.");
		Стартован = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаWTRCСообщенияПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ОставитьОднуЗадачу(ФормируемыеЗадачи, ТочкаМаршрутаБизнесПроцесса);	
	Задача = ФормируемыеЗадачи[0];
	
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.ОбработкаWTRCСообщения.ТочкиМаршрута.ОбработкаWTRCСообщения
		ИЛИ ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.ОбработкаWTRCСообщения.ТочкиМаршрута.ФормированиеУведомленияОКД Тогда
		ИмяТабЧастиИсточника = "Депоненты";
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.ОбработкаWTRCСообщения.ТочкиМаршрута.ДопФормированиеУведомленияОКДПослеФиксации Тогда
		ИмяТабЧастиИсточника = "ДепонентыПослеФиксации";
	КонецЕсли;
	ЗаполнитьТаблицуДепонентовЗадачи(Задача, ИмяТабЧастиИсточника);
	
КонецПроцедуры

/////////////////////////////////////////////////////////////
// ФУНКЦИИ РАБОТЫ С ЗАДАЧАМИ

Процедура ОставитьОднуЗадачу(ФормируемыеЗадачи, ТочкаМаршрутаБизнесПроцесса)
	Если ФормируемыеЗадачи.Количество() = 0 Тогда
		НоваяЗадача = Задачи.ОбработкаWTRCСообщения.СоздатьЗадачу();
		НоваяЗадача.УстановитьНовыйНомер();
		НоваяЗадача.Дата = ТекущаяДата();
		НоваяЗадача.БизнесПроцесс = ЭтотОбъект.Ссылка;
		НоваяЗадача.ТочкаМаршрута = ТочкаМаршрутаБизнесПроцесса;
		ФормируемыеЗадачи.Добавить(НоваяЗадача);
		
	ИначеЕсли ФормируемыеЗадачи.Количество() > 1 Тогда
		Для н = 1 По ФормируемыеЗадачи.Количество()-1 Цикл
			ФормируемыеЗадачи.Удалить(1);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьТаблицуДепонентовЗадачи(Задача, ИмяТабЧастиИсточника)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Депоненты.Депонент КАК Депонент,
	|	ЛОЖЬ КАК ОтправленоУведомлениеККОПеремещенииНаНалоговыйРаздел,
	|	ЛОЖЬ КАК ЦБНаНалоговомРазделе,
	|	Депоненты.ЕстьУсловноеДлящеесяПоручение КАК ЕстьУсловноеДлящеесяПоручение
	|ИЗ
	|	БизнесПроцесс.ОбработкаWTRCСообщения.Депоненты КАК Депоненты
	|ГДЕ
	|	Депоненты.Ссылка = &БизнесПроцессWTRC");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "БизнесПроцесс.ОбработкаWTRCСообщения.Депоненты",
	"БизнесПроцесс.ОбработкаWTRCСообщения." + ИмяТабЧастиИсточника);
	Запрос.УстановитьПараметр("БизнесПроцессWTRC", Ссылка);
	Задача.Депоненты.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

/////////////////////////////////////////////////////////////
// ФУНКЦИИ ОТПРАВКИ ЗАПРОСА НА ФОРМУ W8 ДЕПОНЕНТУ

Функция ДепонентыБезФормыW8(ИмяТабЧастиИсточника = "Депоненты")
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Депоненты.Депонент КАК Депонент,
	|	КодыЗагрузкиКлиента.Код КАК КодЗагрузки,
	|	"""" КАК КодСубклиента
	|ИЗ
	|	БизнесПроцесс.ОбработкаWTRCСообщения.Депоненты КАК Депоненты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиКлиента
	|		ПО Депоненты.Депонент = КодыЗагрузкиКлиента.Владелец
	|			И (НЕ КодыЗагрузкиКлиента.ПометкаУдаления)
	|			И (КодыЗагрузкиКлиента.Биржа = &КлассификаторыЗагрузкиКлиенты)
	|ГДЕ
	|	НЕ Депоненты.ЕстьФормаW8BENE_W8BEN
	|	И Депоненты.Ссылка = &БизнесПроцессWTRC
	|	И НЕ Депоненты.Депонент.Субброкер
	|
	|СГРУППИРОВАТЬ ПО
	|	Депоненты.Депонент,
	|	КодыЗагрузкиКлиента.Код
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Депоненты.Депонент,
	|	КодыЗагрузкиКлиента.Код,
	|	Депоненты.РазделСчета.Субклиент.Код
	|ИЗ
	|	БизнесПроцесс.ОбработкаWTRCСообщения.Депоненты КАК Депоненты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузкиКлиента
	|		ПО Депоненты.Депонент = КодыЗагрузкиКлиента.Владелец
	|			И (НЕ КодыЗагрузкиКлиента.ПометкаУдаления)
	|			И (КодыЗагрузкиКлиента.Биржа = &КлассификаторыЗагрузкиКлиенты)
	|ГДЕ
	|	НЕ Депоненты.ЕстьФормаW8BENE_W8BEN
	|	И Депоненты.Ссылка = &БизнесПроцессWTRC
	|	И Депоненты.Депонент.Субброкер
	|
	|СГРУППИРОВАТЬ ПО
	|	Депоненты.Депонент,
	|	КодыЗагрузкиКлиента.Код,
	|	Депоненты.РазделСчета.Субклиент.Код
	|ИТОГИ
	|	МАКСИМУМ(КодЗагрузки)
	|ПО
	|	Депонент");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "БизнесПроцесс.ОбработкаWTRCСообщения.Депоненты",
	"БизнесПроцесс.ОбработкаWTRCСообщения." + ИмяТабЧастиИсточника);
	Запрос.УстановитьПараметр("КлассификаторыЗагрузкиКлиенты", Справочники.КлассификаторыЗагрузки.Клиенты);
	Запрос.УстановитьПараметр("БизнесПроцессWTRC", Ссылка);
	
	ДепонентыБезФорм = Новый ТаблицаЗначений;
	ДепонентыБезФорм.Колонки.Добавить("Депонент");
	ДепонентыБезФорм.Колонки.Добавить("КодЗагрузки");
	ДепонентыБезФорм.Колонки.Добавить("КодыСубклиентов", Новый ОписаниеТипов("Строка"));
	
	ВыборкаПоДепонентам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоДепонентам.Следующий() Цикл
		НоваяСтрока = ДепонентыБезФорм.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоДепонентам);
		Выборка = ВыборкаПоДепонентам.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока.КодыСубклиентов = НоваяСтрока.КодыСубклиентов
			+ ?(ЗначениеЗаполнено(НоваяСтрока.КодыСубклиентов), ", ", "") + Выборка.КодСубклиента;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ДепонентыБезФорм;
	
КонецФункции

Функция РезультатЗапросаФормыW8(СписокДепонентов)
	Если СписокДепонентов.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Содержание = СодержаниеЗапросаФормыW8();
	Если Содержание = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Строка Из СписокДепонентов Цикл
		Если ЗначениеЗаполнено(Строка.КодыСубклиентов) Тогда
			Текст = СтрЗаменить(Содержание.Текст, "%C", Символы.ПС + "<p>Список клиентов без формы: " + Строка.КодыСубклиентов + ".</p>");
		Иначе
			Текст = СтрЗаменить(Содержание.Текст, "%C", "");
		КонецЕсли;
		
		Удачно = РезультатОтправкиСообщенияПоЭлПочтеЧерезWebСервис(Строка.КодЗагрузки, Содержание.Тема,
		Текст);
		Если Удачно Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отправлен запрос по email на форму W8 "
			+ "депоненту " + Строка.Депонент);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось отправить запрос по email на форму W8 "
			+ "депоненту " + Строка.Депонент);
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

Функция СодержаниеЗапросаФормыW8()
	// {Обязательный блок}
	Текст =
	"<p>#Hello#</p>
	|<p>Уведомляем Вас о том, что в Депозитарий %1 поступила информация о проведении корпоративного действия
	|""%2"" - %3 (%4, Референс КД %5).</p>
	|<p>Дата КД (план.): %6</p>
	|<p>Дата фиксации: %7</p>
	|<p>Для участия в КД необходимо предоставить форму W-8BEN для физических лиц или W-8BENE для 
	|юридических лиц и поручение на прием формы в обработку по форме Приложения 1.10 к РДО.
	|Последний срок подачи документов в %1: %8</p>%C
	|%B";
	
	ВидКД = Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("WTRC");
	Если НЕ ЗначениеЗаполнено(ВидКД) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден вид КД с кодом ""WTRC""");
		Возврат Неопределено;
	КонецЕсли;
	
	Текст = СтрЗаменить(Текст, "%1", СокрЛП(мОрганизация.Наименование));
	Текст = СтрЗаменить(Текст, "%2", СокрЛП(ВидКД.Наименование));
	Текст = СтрЗаменить(Текст, "%3", Справочники.ЦенныеБумаги.НаименованиеЭмитента(ЦеннаяБумага1));
	Текст = СтрЗаменить(Текст, "%4", Документы.УведомлениеКлиентам.ХарактеристикиЦБ(ЦеннаяБумага1, ЦеннаяБумага2));
	Текст = СтрЗаменить(Текст, "%5", СокрЛП(КДРеференс));
	Текст = СтрЗаменить(Текст, "%6", ФорматДаты(ДатаКДПлан));
	Текст = СтрЗаменить(Текст, "%7", ФорматДаты(ДатаФиксации));
	Текст = СтрЗаменить(Текст, "%8", ФорматДаты(Документы.УведомлениеКлиентам.ДобавитьРабочийДень(ДатаКДПлан, -14)));
	Текст = СтрЗаменить(Текст, "%B", Документы.УведомлениеКлиентам.ПодписьСообщения(Дата));
	
	Содержание = Новый Структура;
	Содержание.Вставить("Тема", "Поступила информация о проведении корпоративного действия - подтверждение "
	+ "освобождения от налога");
	Содержание.Вставить("Текст", Текст);
	
	Возврат Содержание;
КонецФункции

// Вызываемый метод Web-сервиса производит отправку произвольного текста на email клиента
//
// Параметры:
//	КлиентИд - Идентификатор клиента, которому необходимо отправить email
//	Тема - Тема письма
//	Текст - Текст письма
//
// Возвращаемое значение:
//	Истина, если отправка успешна, иначе Ложь
//
Функция РезультатОтправкиСообщенияПоЭлПочтеЧерезWebСервис(КлиентИд, Тема, Текст)
	ИдентификаторыКлиентов = Новый Массив;
	ИдентификаторыКлиентов.Добавить(СокрЛП(КлиентИд));
	
	ОпубликованоУспешно = ВебСервисыСервер.РезультатОтправкиИнформационногоПисьмаКлиентам(ИдентификаторыКлиентов, Тема, Текст);
	
	Возврат ОпубликованоУспешно;
КонецФункции

Функция ФорматДаты(Д)
	Возврат	Формат(Д, "ДЛФ=Д");
КонецФункции

Процедура ИспользоватьСхемуУведомленийWTRC_QIПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = WTRCСообщенияQI.ИспользоватьСхемуУведомленийWTRC_QI(ЭтотОбъект.Дата);
	
КонецПроцедуры

Процедура ЦБПопадаетПодНалоговоеРегулированиеСШАПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Если Не ЗначениеЗаполнено(ЦеннаяБумага2) Тогда 
		Результат = Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(ЦеннаяБумага1)
	ИначеЕсли Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(ЦеннаяБумага1) = Истина 
		И Справочники.ЦенныеБумаги.ЦБПодпадаетПодНалоговоеРегулированиеСША(ЦеннаяБумага2) = Истина Тогда 
		Результат = Истина;
	Иначе
		Комментарий = "Режим налогового регулирования США для Ценной бумаги 1 и Ценной бумаги 2, отличаються!";
		Завершен = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ВыполненаПроверкаОстатков = Ложь;
	Для Каждого Строка Из Депоненты Цикл 
		Строка.ЕстьФормаW8BENE_W8BEN = Ложь;
		Строка.УведомлениеW8 = Перечисления.СтатусыЗавершенияБПОбработкаWTRCСообщения.ПустаяСсылка();
		Строка.Уведомление1_10 = Перечисления.СтатусыЗавершенияБПОбработкаWTRCСообщения.ПустаяСсылка();
		Строка.ЗапросНаРаскрытие = Перечисления.СтатусыЗавершенияБПОбработкаWTRCСообщения.ПустаяСсылка();	
	КонецЦикла;
	
КонецПроцедуры

Процедура ИспользоватьСхемуУсловногоДлящегосяПоручения_ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ЭтотОбъект.ИспользоватьСхемуУсловногоДлящегосяПоручения;
	
КонецПроцедуры

Процедура ДатаФиксацииБольшеДатыСообщения_ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	ДатаФиксацииСоВременем = ЭтотОбъект.ДатаФиксации;
	ОбщегоНазначения.СкопироватьВремя(ДатаФиксацииСоВременем, '00010101190000');
	Результат = ДатаФиксацииСоВременем > ЭтотОбъект.ДатаСообщения;
	
КонецПроцедуры

Процедура ИспользоватьСхемуУведомленийWTRC_QI_НеАмериканскихЦБПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = WTRCСообщенияQI.ИспользоватьСхемуУведомленийWTRC_QI(ЭтотОбъект.Дата);
	
КонецПроцедуры

// Процедура - Обновить статусы отправки запросов субброкера
// Обновляет в табличной части статусы отправки запросов субброкера на раскрытие
Процедура ОбновитьСтатусыОтправкиЗапросовСубброкера() Экспорт
	
	Если WTRCСообщенияQI.ИспользоватьРегистрациюЗапросовСубброкераДляДокумента(КД) 
		И WTRCСообщенияQI.ИспользоватьСхемуУведомленийWTRC_QIДляДокумента(КД) Тогда 
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗапросСубброкеруНаРаскрытие.Клиент КАК Депонент,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗапросСубброкеруНаРаскрытие.Ссылка) КАК Ссылка
		|ИЗ
		|	Документ.ЗапросСубброкеруНаРаскрытие КАК ЗапросСубброкеруНаРаскрытие
		|ГДЕ
		|	ЗапросСубброкеруНаРаскрытие.Статус В(&СтатусыОтправленныеУведомления)
		|	И ЗапросСубброкеруНаРаскрытие.КД = &КД
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапросСубброкеруНаРаскрытие.Клиент");
		
		СтатусыОтправленныеУведомления = Новый Массив();
		СтатусыОтправленныеУведомления.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.Отправлен);
		СтатусыОтправленныеУведомления.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ОтправленПовторно);
		СтатусыОтправленныеУведомления.Добавить(Перечисления.СтатусыДокументаЗапросСубброкеруНаРаскрытие.ПолученОтвет);
		Запрос.УстановитьПараметр("СтатусыОтправленныеУведомления", СтатусыОтправленныеУведомления);
		Запрос.УстановитьПараметр("КД", КД);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда 
			Возврат;	
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл 
			СтрокиДепонента = Депоненты.НайтиСтроки(Новый Структура("Депонент",Выборка.Депонент));
			Для Каждого СтрокаДепонента Из СтрокиДепонента Цикл 
				СтрокаДепонента.ЗапросНаРаскрытие = Перечисления.СтатусыЗавершенияБПОбработкаWTRCСообщения.Отправлено;		
			КонецЦикла;
		КонецЦикла;
		
		Документы.РаскрытиеСпискаВладельцев.ДополнитьСписокВладельцевЗапросамиСубброкера(КД);
		
	КонецЕсли;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мОрганизация = Константы.ОрганизацияПоУмолчанию.Получить();
